rails/rails_project/sample_app/app/controllers/microposts_controller.rb

  def create
    p params
    @micropost = current_user.microposts.build(micropost_params)
    if @micropost.save
---
INSERT INTO "microposts" ("content", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?)  [["content", "post test content"], ["created_at", Sun, 03 Nov 2013 11:33:08 UTC +00:00], ["updated_at", Sun, 03 Nov 2013 11:33:08 UTC +00:00], ["user_id", 3]]

  def destroy
    micropost = current_user.microposts.find_by(:id => params[:id])
    micropost.destroy
---
SELECT "microposts".* FROM "microposts" WHERE "microposts"."user_id" = ? AND "microposts"."id" = ? ORDER BY created_at DESC LIMIT 1  [["user_id", 3], ["id", "104"]]
DELETE FROM "microposts" WHERE "microposts"."id" = ?  [["id", 104]]