rails/rails_project/sample_app/app/controllers/pages_controller.rb

SELECT "microposts".* FROM "microposts" WHERE (user_id = 3) ORDER BY created_at DESC LIMIT 10 OFFSET 0
SELECT COUNT(*) FROM "microposts" WHERE "microposts"."user_id" = ?  [["user_id", 3]]
---
  def home
    if signed_in?
     @title="#{current_user.name}'s 'Home"
     @micropost = current_user.microposts.build
     @feed_items = current_user.feed.paginate(page: params[:page], per_page: 10)