rails/rails_project/sample_app/app/controllers/sessions_controller.rb

  def create
    # params表单名:session, has_secure_password 提供的 authenticate 方法
    user = User.find_by(email: params[:session][:email].downcase)
---
SELECT "users".* FROM "users" WHERE "users"."email" = 'user1@ex.com' LIMIT 1