rails/rails_project/sample_app/app/controllers/users_controller.rb

  def show
    if @user.nil?
      # 因为correct_check过滤器中定义了@user，这里不需要重复查询了
      begin
        @user = User.find(params[:id])
      rescue ActiveRecord::RecordNotFound
        flash[:error] = "User id #{params[:id]} not found"
        redirect_to not_found_url
      else
      end
    end
    @microposts = @user.microposts.paginate(page: params[:page], per_page: 10)
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", "1"]]
SELECT COUNT(*) FROM "microposts" WHERE "microposts"."user_id" = ?  [["user_id", 3]]

  def create
    # 我们使用 params 获取用户的 id。当我们向 Users 控制器发送请求时，params[:id]
    # 会返回用户的 id，即 1，所以这和直接调用 User.find(1) 的效果一样。（严格来说，
    # params[:id] 返回的是字符串 "1"，find 方法会自动将其转换成整数形式
    #@user = User.find_by(user_params);
    @user = User.new(user_params)
    if @user.save
---
INSERT INTO "users" ("created_at", "email", "name", "password_digest", "remember_token", "updated_at") VALUES (?, ?, ?, ?, ?, ?)

  def update
    # 因为correct_check过滤器中定义了@user，这里不需要重复查询了
    # @user = User.find_by(params[:id])
    # 使用安全参数user_params
    if @user.update_attributes(user_params)
---
UPDATE "users" SET "email" = ?, "password_digest" = ?, "updated_at" = ? WHERE "users"."id" = 2  [["email", "user11@ex.com"], ["password_digest", "$2a$10$YpJ21Ht6kHhQQddQO35uN.TQEXHyIm.vexWGuKk9kmsOGtBTlaxgO"], ["updated_at", Tue, 29 Oct 2013 14:05:33 UTC +00:00]]

  def index
    # params由will_paginate自动生成，默认取回30个条目
    @users = User.paginate(page: params[:page], per_page: 10)
---
SELECT "users".* FROM "users"
SELECT COUNT(*) FROM "users"

  def destroy
    user = User.find(params[:id])
    p user
    user.destroy
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", "4"]]
DELETE FROM "users" WHERE "users"."id" = ?  [["id", 1]]