rails/rails_project/sample_app/app/views/shared/_stat.html.erb

  <strong>
  <%if @user.microposts.any? %>
---
SELECT 1 AS one FROM "microposts" WHERE "microposts"."user_id" = ? ORDER BY created_at DESC LIMIT 1  [["user_id", 1]]